# -----------------------------------------------
# Программа для проверки соответствия тестовым полям
# -----------------------------------------------

# 1. LDC (Загрузка константы)
# Тест: A=4, B=91, C=651 [cite: 8]
LDC R[91] = 651

# 2. LDM (Чтение значения из памяти)
# Тест: A=14, B=820, C=53 [cite: 14]
LDM R[53] = M[820]

# 3. STM (Запись значения в память)
# Тест: A=10, B=5, C=8 [cite: 20]
STM M[R[5]] = R[8]

# 4. BIN_OP (Бинарная операция)
# Тест: A=5, B=85, C=310, D=6 [cite: 27]
BIN_OP R[6], R[85], 310